#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

In [1]:
import pandas as pd

In [2]:
data=[4, 8, 15, 16, 23, 42]
series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
import pandas

In [4]:
lis=[1,5,7,3,9,8,4,2,6,0]
series1=pd.Series(lis)
print(series1)

0    1
1    5
2    7
3    3
4    9
5    8
6    4
7    2
8    6
9    0
dtype: int64

#### Q3. Create a Pandas DataFrame that contains the following data:
Name:
Alice
Bob
Claire

Age:
25
30
27

Gender:
Female
Male
Female

#### Then, print the DataFrame.

In [5]:
import pandas as pd
dict={'Name':['Alice','Bob','Claire'],'Age':[25,30,37],'Gender':['Female','Male','Female']}
df=pd.DataFrame(dict)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   37  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional tabular data structure that consists of rows and columns. It can be thought of as a collection of Pandas Series, where each Series represents a column. DataFrames provide a convenient way to manipulate, analyze, and visualize structured data.

In pandas, a DataFrame is a two-dimensional tabular data structure that consists of rows and columns. It can be thought of as a collection of Pandas Series, where each Series represents a column. DataFrames provide a convenient way to manipulate, analyze, and visualize structured data.

A Pandas Series,is a one-dimensional labeled array that can hold data of any type (e.g., integers, floats, strings, etc.). It represents a single column of data with an associated index. Series are the building blocks of a DataFrame.

In [6]:
import pandas as pd

data = {
    'Name': ['John', 'teja', 'kushi', 'manu'],
    'Age': [25, 28, 22, 30],
    'City': ['New York', 'London', 'Paris', 'Sydney']
}
df = pd.DataFrame(data)
age_series = df['Age']
print(df)
print(age_series)

    Name  Age      City
0   John   25  New York
1   teja   28    London
2  kushi   22     Paris
3   manu   30    Sydney
0    25
1    28
2    22
3    30
Name: Age, dtype: int64

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

head() and tail(): These functions allow you to view the first five rows (head()) or the last five rows (tail()) of a DataFrame. 

We can also pass argument like head(4)....
Then it will print first 4 records

In [7]:
df.head(3)

    Name  Age      City
0   John   25  New York
1   teja   28    London
2  kushi   22     Paris

In [8]:
df.head()

    Name  Age      City
0   John   25  New York
1   teja   28    London
2  kushi   22     Paris
3   manu   30    Sydney

In [9]:
df.tail(2)

    Name  Age    City
2  kushi   22   Paris
3   manu   30  Sydney

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series and DataFrame are mutable in nature, while Panel is not.

1.Series: 
A Pandas Series is mutable, meaning you can modify its elements after creation. You can change the values in a Series by assigning new values to specific indexes or using methods like .loc or .iloc to access and modify elements.

In [10]:
import pandas as pd
my_series = pd.Series([1, 2, 3, 4, 5])
my_series[2] = 10
print(my_series)

0     1
1     2
2    10
3     4
4     5
dtype: int64

DataFrame:  Pandas DataFrame is mutable. You can modify its elements by assigning new values to specific cells, columns, or rows. DataFrame provides various methods to modify data, such as .loc, .iloc, and DataFrame assignment.

In [11]:
import pandas as pd
data={'A': [1, 2, 3], 'B': [4, 5, 6]}
df=pd.DataFrame(data)
df.at[1, 'B'] = 10
print(df)

   A   B
0  1   4
1  2  10
2  3   6

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [12]:
name=pd.Series(['Alice','Bob','Claire'])
age=pd.Series([25,30,27])
gender=pd.Series(['Female','Male','Female'])
dict={'Name':name,'Age':age,'Gender':gender}
df=pd.DataFrame(dict)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female